HELP_MSG = 'Хэй! Смотри, вот полный список моих команд:\n\n' \
           '📌 /start - прочти ещё разок небольшую справку обо мне!\n' \
           '📌 /search - найди нужный материал в моей библиотеке!\n' \
           '📌 /upload - загрузи свои материалы, чтобы они были ' \
           'доступны другим!\n' \
           '📌 /about - узнай чуть больше о создателях проекта или ' \
           'оставь отзыв/предложение!\n' \
           '📌 /cancel - передумал? останови процесс ' \
           'поиска/загрузки материалов!\n' \
           '📌 /help - посмотри подробную подсказку по командам, ' \
           'если вдруг что-нибудь забудешь :^)'

START_MSG = 'Привет! Этот бот - база данных по специальности с ' \
            'удобным поиском и рейтингом. Мудл на максималках!\n\n' \
            'Вы можете:\n\n' \
            '📤 Загружать различные учебные материалы\n' \
            '🔍 Искать уже загруженные материалы по ключевым словам, темам\n' \
            '📈 Оценивать загруженные материалы, давая другим ' \
            'возможность находить достойные материалы быстрее'

SEARCH_MSG = '🔍 Введи поисковый запрос, а я постараюсь тебе помочь!\n\n' \
             'Для выхода из режима поиска введи /cancel'

UNKNOWN_CMD_MSG = 'Прости, дружок, я тебя не понимаю :(\nИспользуй ' \
                  'всплывающие подсказки или /help, если позабыл, какие ' \
                  'команды тебе доступны!'

NO_RESULTS_MSG = 'Упс, похоже, материалов по твоему запросу ещё нет в ' \
                 'моей библиотеке :( Попробуй переформулировать его или ' \
                 'первым загрузи материал по теме!'

NEEDS_REG_MSG = 'Загружать материалы могут только зарегистрированные ' \
                'пользователи!\nВведи своё имя и фамилию, пожалуйста!\n\n' \
                'Для выхода из режима регистрации введи /cancel'

INCORRECT_DATA_MSG = 'Упс! Кажется, ты ввёл некорректные данные. ' \
                     'попробуй ещё разок, пожалуйста.'

ABOUT_MSG = 'Авторы супер'

UPLOAD_TITLE_MSG = '📤 Введи название материала для загрузки'

UPLOAD_COURSE_MSG = 'Теперь укажи курс, к которому относится твой материал'

UPLOAD_SUBJECT_MSG = 'И, наконец, введи название предмета, которому ' \
                     'соответствует твой материал'

UPLOAD_FILE_MSG = 'Отлично! Теперь загрузи файл, а я добавлю его ' \
                  'в свою библиотеку!'

UPLOAD_SUCCESS_MSG = 'Отлично! Ваш материал добавлен в базу.'

REG_MAIL_MSG = 'Отлично! Теперь укажи адрес своей почты в домене bmstu.ru'

REG_CODE_MSG = 'Супер! Чтобы подтвердить регистрацию, напиши мне что-нибудь ' \
               'с этой почты на @bot.bot'
