HELP_MSG = '👋 Хэй! Смотри, вот полный список моих команд:\n\n' \
           '📌 /start - прочти ещё разок небольшую справку обо мне!\n' \
           '📌 /search - найди нужный материал в моей библиотеке!\n' \
           '📌 /upload - загрузи свои материалы, чтобы они были ' \
           'доступны другим!\n' \
           '📌 /about - узнай чуть больше о создателях проекта или ' \
           'оставь отзыв/предложение!\n' \
           '📌 /cancel - передумал? останови процесс ' \
           'поиска/загрузки материалов!\n' \
           '📌 /help - посмотри подробную подсказку по командам, ' \
           'если вдруг что-нибудь забудешь :^)'

START_MSG = 'Привет! Этот бот - база данных по специальности с ' \
            'удобным поиском и рейтингом. Мудл на максималках!\n\n' \
            'Ты можешь:\n\n' \
            '📤 Загружать различные учебные материалы\n' \
            '🔍 Искать уже загруженные материалы\n' \
            '📈 Оценивать загруженные материалы, давая другим ' \
            'возможность находить достойные материалы быстрее\n\n' \
            'Пиши /help, чтобы узнать меня получше!'

SEARCH_MSG = '🔍 Введи поисковый запрос, а я постараюсь тебе помочь!\n\n' \
             'Для выхода из режима поиска введи /cancel'

UNKNOWN_CMD_MSG = '💧 Прости, дружок, я тебя не понимаю :(\n\nИспользуй ' \
                  'всплывающие подсказки или /help, если позабыл, какие ' \
                  'команды тебе доступны!'

NO_RESULTS_MSG = '💧 Упс, похоже, материалов по твоему запросу ещё нет в ' \
                 'моей библиотеке :(\n\nПопробуй переформулировать его или ' \
                 'первым загрузи материал по теме!'

NEEDS_REG_MSG = '❗ Загружать и скачивать материалы могут только ' \
                'зарегистрированные пользователи! Введи своё имя и фамилию, ' \
                'пожалуйста!\n\nДля выхода из режима регистрации введи /cancel'

INCORRECT_DATA_MSG = 'Упс! Кажется, ты ввёл некорректные данные. ' \
                     'Попробуй ещё разок, пожалуйста.'

ABOUT_MSG = 'Привет! Мы команда WexL00P:\n\n' \
            '👨🏻‍💻 Матвей @kottsovcom\n' \
            '👨🏻‍💻 Даня @daniilporoshin\n' \
            '👨🏼‍💻 Макс @maksim_borisovv\n' \
            '👨🏻‍💻 Кирилл @IgorVitalevich\n' \
            '👩🏻‍💻 Маша @sleepy_owlet\n\n' \
            'Есть предложения или жалобы?\n' \
            'Обращайся, будем рады помочь :)\n\n' \
            '📮 <b>BaumanLibBot by WexL00P 2020</b>'

UPLOAD_TITLE_MSG = '📤 Введи название материала для загрузки'

UPLOAD_COURSE_MSG = 'Теперь укажи курс, к которому относится твой материал'

UPLOAD_SUBJECT_MSG = 'И, наконец, введи название предмета, которому ' \
                     'соответствует твой материал'

UPLOAD_FILE_MSG = 'Отлично! Теперь загрузи файл, а я добавлю его ' \
                  'в свою библиотеку!'

UPLOAD_SUCCESS_MSG = '🌟 Файл успешно загружен! Спасибо, что пополняешь ' \
                     'мою библиотеку!'

REG_MAIL_MSG = 'Отлично! Теперь укажи адрес своей почты в домене bmstu.ru'

REG_CODE_MSG = 'Супер! Я отправил на эту почту специальной код. Напиши ' \
               'его сюда обычным сообщением, чтобы завершить регистрацию'

REG_SUCCESS_MSG = '🌟 Отлично! Теперь ты спокойно можешь загружать свои ' \
                  'материалы!\n\nТолько не используй меня как хранилище ' \
                  'личных файлов и следи за качеством загружаемых ' \
                  'материалов, иначе мне придется тебя заблокировать :('

DOWNLOAD_SUCCESS_MSG = '🌟 Вот твой файл! Пожалуйста, оцени материал, ' \
                       'чтобы улучшить качество поиска ;)'
